src/Documents/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Проекты</name>
  <comment>Документ, представляющий проект</comment>
  <registerRecords>InformationRegister.СотрудникиНаПроектах</registerRecords>
  <attributes>
    <name>НазваниеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроекта</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроекта</name>
    <type>
      <types>EnumRef.СтатусПроекта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнтервалыЗанятостиСотрудников</name>
    <attributes>
      <name>ИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоИнтервала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецИнтервала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентЗанятости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПересеченияСОтпуском</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КомандаПроекта</name>
    <attributes>
      <name>ИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИсторияГрафикаОтпусков/ИсторияГрафикаОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияГрафикаОтпусков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаОтпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ГрафикОтпусков/ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ИсторияГрафикаОтпусков</registerRecords>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаОтпуска</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Проекты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РуководительПроектаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных();
	Элемент = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Элемент.Использование = Истина;
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Должность");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = ВернутьСсылкуНаЗаписьРуководительПроекта();
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКД);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элементы.РуководительПроекта);	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомандаПроекта
&НаКлиенте
Процедура КомандаПроектаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Сотрудник = Элемент.ТекущиеДанные.Сотрудник;
	Если ПересекаетсяЛиСотрудникСГрафикомОтпусков(Сотрудник, Объект.ДатаНачала, Объект.ДатаОкончания) Тогда
		ПоказатьПредупреждение(,"Отпуск сотрудника пересекается с проектом!",,);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ПересекаетсяЛиСотрудникСГрафикомОтпусков(Сотрудник, НачалоПроекта, КонецПроекта)

	//Запрос к документу График Отпусков
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГрафикОтпусков.НачалоПериода КАК НачалоПериода,
		|	ГрафикОтпусков.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ГрафикОтпусков КАК ГрафикОтпусков";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	НачалоПериода = ВыборкаДетальныеЗаписи.НачалоПериода;
	КонецПериода = ВыборкаДетальныеЗаписи.КонецПериода;
	
	//Запрос к регистру История Графика Отпусков
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИсторияГрафикаОтпусковСрезПоследних.НачалоПериода,
		|	ИсторияГрафикаОтпусковСрезПоследних.КонецПериода,
		|	ИсторияГрафикаОтпусковСрезПоследних.Сотрудник,
		|	ИсторияГрафикаОтпусковСрезПоследних.ДатаНачалаОтпуска,
		|	ИсторияГрафикаОтпусковСрезПоследних.КоличествоДней КАК КоличествоДней
		|ИЗ
		|	РегистрСведений.ИсторияГрафикаОтпусков.СрезПоследних КАК ИсторияГрафикаОтпусковСрезПоследних
		|ГДЕ
		|	ИсторияГрафикаОтпусковСрезПоследних.Сотрудник = &Сотрудник
		|	И ИсторияГрафикаОтпусковСрезПоследних.НачалоПериода = &НачалоПериода
		|	И ИсторияГрафикаОтпусковСрезПоследних.КонецПериода = &КонецПериода";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий(); 
	
	НачалоОтпуска = ВыборкаДетальныеЗаписи.ДатаНачалаОтпуска;
	КонецОтпуска = 
		ВыборкаДетальныеЗаписи.ДатаНачалаОтпуска + ВыборкаДетальныеЗаписи.КоличествоДней * 86400;
	
	Результат = (НачалоПроекта <= КонецОтпуска И КонецПроекта >= НачалоОтпуска);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВернутьСсылкуНаЗаписьРуководительПроекта()
    Возврат Справочники.Должности.РуководительПроекта;
КонецФункции
#КонецОбласти
